# Prisoners Data Visualization

### Step 1: Import the necessary libraries

In [1]:
import pandas as pd

### Step 2: Load the data and display first 5 and last 5 records

In [2]:
data = pd.read_csv('Prisoners-Dataset.csv')

In [3]:
data.head()

,STATE/UT,YEAR,No. of Inmates benefitted by Elementary Education,No. of Inmates benefitted by Adult Education,No. of Inmates benefitted by Higher Education,No. of Inmates benefitted by Computer Course
0,Andhra Pradesh,2013,9480,13758,672,170
1,Arunachal Pradesh,2013,0,0,0,0
2,Assam,2013,676,750,14,30
3,Bihar,2013,1693,3013,125,1417
4,Chhatisgarh,2013,1664,1803,192,103

### Step 3: Describe the data

In [4]:
data.describe()

,YEAR,No. of Inmates benefitted by Elementary Education,No. of Inmates benefitted by Adult Education,No. of Inmates benefitted by Higher Education,No. of Inmates benefitted by Computer Course
count,35.0,35.000000,35.000000,35.000000,35.000000
mean,2013.0,1057.914286,1534.857143,237.457143,210.171429
std,0.0,2078.196777,3022.110503,375.614191,359.117340
min,2013.0,0.000000,0.000000,0.000000,0.000000
25%,2013.0,0.000000,6.500000,2.000000,0.000000
50%,2013.0,167.000000,237.000000,33.000000,38.000000
75%,2013.0,1294.500000,1733.500000,234.500000,227.500000
max,2013.0,9480.000000,13758.000000,1353.000000,1417.000000

### Step 4: Create a column 'total_benefitted' that shows sum of inmates with respect to each State/UT

In [6]:
data['total'] = data.sum(axis=1)

In [7]:
data.columns

Index(['STATE/UT', 'YEAR', 'No. of Inmates benefitted by Elementary Education',
       'No. of Inmates benefitted by Adult Education',
       'No. of Inmates benefitted by Higher Education',
       'No. of Inmates benefitted by Computer Course', 'total'],
      dtype='object')

In [8]:
data['new'] = data[['No. of Inmates benefitted by Elementary Education',
       'No. of Inmates benefitted by Adult Education',
       'No. of Inmates benefitted by Higher Education',
       'No. of Inmates benefitted by Computer Course', 'total']].sum(axis=1)

In [9]:
data.head()

,STATE/UT,YEAR,No. of Inmates benefitted by Elementary Education,No. of Inmates benefitted by Adult Education,No. of Inmates benefitted by Higher Education,No. of Inmates benefitted by Computer Course,total,new
0,Andhra Pradesh,2013,9480,13758,672,170,26093,50173
1,Arunachal Pradesh,2013,0,0,0,0,2013,2013
2,Assam,2013,676,750,14,30,3483,4953
3,Bihar,2013,1693,3013,125,1417,8261,14509
4,Chhatisgarh,2013,1664,1803,192,103,5775,9537

In [10]:
data.drop('YEAR',axis=1,inplace=True)
data.drop('new',axis=1,inplace=True)
data.drop('total',axis=1,inplace=True)

In [11]:
data.head()

,STATE/UT,No. of Inmates benefitted by Elementary Education,No. of Inmates benefitted by Adult Education,No. of Inmates benefitted by Higher Education,No. of Inmates benefitted by Computer Course
0,Andhra Pradesh,9480,13758,672,170
1,Arunachal Pradesh,0,0,0,0
2,Assam,676,750,14,30
3,Bihar,1693,3013,125,1417
4,Chhatisgarh,1664,1803,192,103

In [12]:
import matplotlib.pyplot as plt

### Step 5: Create a bar char with total benefitted inmates values in descending order

### Step 6: Create a pie chart to show ratio among different modes of benefits

### Step 7: For the 5 highest benefitted states, create 
1. Bar chart. 
2. Stacked bar chart 
3. 100% stacked chart